## Conecciones con pandas y MySQL

Generalmente en las organizaciones los datos se encuentran en Bases de datos que pueden ser estructuradas (MySQL, MariaDB, SQL Server, PostgreSQL, etc) y no estructuradas (MongoDB, Dynamo DB, etc), en la sesion de hoy trabajaremos con Conecciones a MySQL

<img src = https://www.scylladb.com/wp-content/uploads/nosql-design-principles-diagram.png>

In [3]:
!pip install mysql-connector-python

Defaulting to user installation because normal site-packages is not writeable
Collecting mysql-connector-python
  Obtaining dependency information for mysql-connector-python from https://files.pythonhosted.org/packages/55/8e/1270601b42d40c4fb0191fd9043430889510bdbc711c482b12e6f66099e2/mysql_connector_python-8.1.0-cp311-cp311-manylinux_2_17_x86_64.whl.metadata
  Downloading mysql_connector_python-8.1.0-cp311-cp311-manylinux_2_17_x86_64.whl.metadata (2.0 kB)
Collecting protobuf<=4.21.12,>=4.21.1 (from mysql-connector-python)
  Downloading protobuf-4.21.12-cp37-abi3-manylinux2014_x86_64.whl (409 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 409.8/409.8 kB 6.7 MB/s eta 0:00:00a 0:00:01
Downloading mysql_connector_python-8.1.0-cp311-cp311-manylinux_2_17_x86_64.whl (27.5 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 27.5/27.5 MB 37.5 MB/s eta 0:00:0000:0100:01
Installing collected packages: protobuf, mysql-connector-python
  Attempting uninstall: protobuf
    Found existing installation: protobuf 4.24.2
    Uninstalling protobuf-4.24.2:
      Successfully uninstalled protobuf-4.24.2
ERROR: pip's dependency resolver does not currently take into account all the packages that are installed. This behaviour is the source of the following dependency conflicts.
tensorflow 2.13.0 requires typing-extensions<4.6.0,>=3.6.6, but you have typing-extensions 4.7.1 which is incompatible.
Successfully installed mysql-connector-python-8.1.0 protobuf-4.21.12

In [14]:
import mysql.connector
import pandas as pd
# Define the connection string (assuming a typical localhost setup for demonstration)
connection_string = {
    'user' : 'doadmin',
    'password' : 'AVNS_A6UuLOJnpuLq914_QvD',
    'host' : 'test-db-python-datascience-gaope-do-user-13295890-0.b.db.ondigitalocean.com',
    'port' : 25060,
    'database' :'Ejercicio'
}

# Establish the connection
connection = mysql.connector.connect(**connection_string)

# Check if connection is established
if connection.is_connected():
    print("Connected to MySQL server")
    df = pd.read_sql("SELECT*FROM Ejercicio1",connection)
    connection.close()
else:
    print("Failed to connect")

Connected to MySQL server

/tmp/ipykernel_16259/2769882810.py:18: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql("SELECT*FROM Ejercicio1",connection)

    ID_Venta    Categoria Hora_Dia  Unidades_Vendidas  Ingresos
0          1  Electrónica    Tarde                 15   317.000
1          2      Muebles    Noche                 17   441.845
2          3         Ropa   Mañana                  2   397.534
3          4  Electrónica   Mañana                  9   291.439
4          5      Muebles    Noche                  1   370.833
..       ...          ...      ...                ...       ...
95        96  Electrónica    Tarde                  7   237.442
96        97    Alimentos    Tarde                  8   415.549
97        98      Muebles   Mañana                 19   264.549
98        99         Ropa   Mañana                 12   243.709
99       100  Electrónica   Mañana                 18   259.800

[100 rows x 5 columns]